LEXICON_RU: dict[str, str] = {
    "/start": (
        "<b>Для чего этот тест?</b>\n\n"
        "Этот тест поможет вам оценить свою физическую подготовку,"
        " и узнать смогли бы вы пройти фитнес тест в Академию ФБР.\n\n"
        "При поступлении в Академию рекруты ФБР должны сдать этот тест."
        " Он состоит из пяти упражнений: скручивания, спринт, отжимания,"
        " бег, подтягивания.\n\n"
        "Давай познакомимся и начнем... Выберите свой пол:"
    ),
    "table_caption": "Таблица норматива",
    "btn_male": "Мужчина",
    "btn_female": "Женщина",
}

# "<b>PFT состоит из пяти упражнений</b>:\n\n"
# "<b>1. Скручивания</b>: максимальное количество непрерывных"
# " скручиваний за одну минуту.\n"
# "<b>2. Спринт</b>: бег на 300 метров на время\n"
# "<b>3. Отжимания</b>: максимальное количество непрерывных отжиманий"
# " (без учета времени)\n"
# "<b>4. Бег: бег на 1,5 мили (2,415 км) на время.\n"
# "<b>5. Подтягивания</b>: максимальное количество непрерывных"
# " подтягиваний (без учета времени)."
