LEXICON_RU: dict[str, str] = {
    # Commands
    "/start": (
        "<b>Для чего этот тест?</b>\n\n"
        "Этот тест поможет вам оценить свою физическую подготовку,"
        " и узнать смогли бы вы пройти фитнес тест в Академию ФБР.\n\n"
        "При поступлении в Академию рекруты ФБР должны сдать этот тест."
        " Он состоит из пяти упражнений: скручивания, спринт, отжимания,"
        " бег, подтягивания.\n\n"
        "Давай познакомимся и начнем... Выберите свой пол:"
    ),
    "/info": (
        "<b>FBI PFT состоит из пяти упражнений</b>:\n\n"
        "<b>1. Скручивания</b>: максимальное количество непрерывных"
        " скручиваний за одну минуту.\n"
        "<b>2. Спринт</b>: бег на 300 метров на время\n"
        "<b>3. Отжимания</b>: максимальное количество непрерывных отжиманий"
        " (без учета времени)\n"
        "<b>4. Бег: бег на 1,5 мили (2,415 км) на время.\n"
        "<b>5. Подтягивания</b>: максимальное количество непрерывных"
        " подтягиваний (без учета времени)."
    ),
    # Content
    "table_caption": "Таблица норматива",
    "registered": "Добро пожаловать, давайте начнем /help",
    "more_info_header": (
        "Упражнения выполняются поочерёдно с 5 минутным отдыхом между"
        " упражнениями. Порядок выполнения: скручивания, спринт, отжимания,"
        " бег, подтягивания."
    ),
    "more_info_page_1": (
        "<b>Скручивания</b>\n\n"
        "• Лягте на спину, касаясь лопатками пола, руки скрещены на груди. "
        "Согните колени на 90 градусов и поставьте ступни на пол.\n"
        "• Попросите партнера удерживать ваши ноги.\n"
        "• Поднимите верхнюю часть тела до тех пор, пока локти не коснутся "
        "середины бедра, затем вернитесь в исходное положение. "
        "Это одно скручивание.\n"
        "• Если вы остановитесь, вы проиграете оставшуюся минуту!\n"
    ),
    "more_info_page_2": (
        "<b>Бег 300 метров</b>\n\n"
        "• На дорожке длиной в 400 метров, стартуя из стоячего положения, "
        "пробегите 300 метров без остановки."
    ),
    "more_info_page_3": (
        "<b>Отжимания</b>\n\n"
        "• Руки должны находиться на расстоянии не более двух рук от ширины"
        " плеч, локти отведены от тела. Ваши ноги могут быть не более "
        "чем в 3 дюймах друг от друга, ступни касаются пола.\n"
        "• Во время отжимания ваши верхние руки должны быть параллельны полу.\n"
        "• Вернитесь в исходное положение и немедленно начните следующее повторение.\n"
        "• Если вы остановитесь, то вы завершаете отжимания!"
    ),
    "more_info_page_4": (
        "<b>Бег 1,5 мили</b>\n\n"
        "• На дорожке длиной в 400 метров, стартуя из стоячего положения,"
        "  пробегите шесть кругов."
    ),
    "more_info_page_5": (
        "<b>Подтягивания</b>\n\n"
        "• Висните на горизонтальной перекладине, руки на ширине плеч "
        "(но не более 23 дюймов). "
        "Ладони должны быть повернуты от вашего лица, руки полностью вытянуты.\n"
        "• Подтяните свое тело вверх, пока ваш подбородок не окажется "
        "выше перекладины. "
        "(Никакого качания или рывков!)\n"
        "• Опуститесь в начальное положение. Это одно повторение.\n"
        "• Если вы остановитесь, то вы завершаете подтягивания!"
    ),
    # Buttons
    "btn_male": "Мужчина",
    "btn_female": "Женщина",
    "btn_more_info": "Больше информации",
    # Form
    # Forms
    "test_result_form_header": "Давайте посчитаем ваш результат...",
    "test_result_form_situps": "Сколько вы выполнили скручиваний?",
    "test_result_form_sprint": "Как быстро вы пробежали 300 метров?",
    "test_result_form_pushups": "Сколько вы выполнили отжиманий?",
    "test_result_form_running": "За сколько вы пробежали 2.46 км?",
    "test_result_form_pullups": "Сколько раз вы подтянулись?",
    # Warnings
    "start_warning": "Вы уже запустили меня. /help",
    "sex_warning": "Пожалуйста, выберите свой пол для начала.",
    "sex_pressed_warning": "Вы уже выбрали пол. /help",
}
